1521716/stm32-learning/STM32Projects/复习_2026_08_08/模块七_USART/USART发送+接收Hex数据包/Hardware/USART.c
#include "stm32f10x.h"                  // Device header
#include <stdio.h>

uint8_t MyUSART_RxFlag;
uint8_t TxPacket[4];
uint8_t RxPacket[4];

void MyUSART_Init(void)
{
	// RCC
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	// 配置GPIO（RX,TX）
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	// 配置USART
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = 9600;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_Init(USART1,&USART_InitStructure);
	
	// 开启中断
	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);
	
	// NVIC
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	// 使能USART
	USART_Cmd(USART1,ENABLE);
}

void MyUSART_SendByte(uint8_t Byte)
{
	USART_SendData(USART1,Byte);
	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE) == RESET);
}

void MyUSART_SendArray(uint8_t *Array,uint16_t Length)
{
	uint16_t i = 0;
	for(i = 0;i<Length;i++)
	{
		USART_SendData(USART1,Array[i]);
		while(USART_GetFlagStatus(USART1,USART_FLAG_TXE) == RESET);
	}
}

void MyUSART_SendString(char *String,uint16_t Length)
{
	uint16_t i = 0;
	for(i = 0;i<Length;i++)
	{
		USART_SendData(USART1,String[i]);
		while(USART_GetFlagStatus(USART1,USART_FLAG_TXE) == RESET);
	}
}

int fputc(int ch,FILE* f)
{
	MyUSART_SendByte(ch);
	return ch;
}

uint8_t MyUSART_GetRxFlag(void)
{
	if(MyUSART_RxFlag == 1)
	{
		MyUSART_RxFlag = 0;
		return 1;
	}
	return 0;
}


void MyUSART_SendPacket(void)
{
	MyUSART_SendByte(0xFF);
	MyUSART_SendArray(TxPacket,4);
	MyUSART_SendByte(0xFE);
}

void USART1_IRQHandler(void)
{
	static uint8_t RxState = 0; 
	static uint8_t pRxPacket = 0; 
	if(USART_GetITStatus(USART1,USART_IT_RXNE) == SET)
	{
		uint8_t RxData = USART_ReceiveData(USART1);
		if(RxState == 0)
		{
			if(RxData == 0xFF)
			{
				RxState = 1;
			}
		}
		else if(RxState == 1)
		{
			RxPacket[pRxPacket] = RxData;
			pRxPacket++;
			if(pRxPacket>=4)
			{
				RxState = 2;
				pRxPacket = 0;
			}
		}
		else if(RxState == 2)
		{
			if(RxData == 0xFE)
			{
				RxState = 0;
				MyUSART_RxFlag = 1;
			}
		}
		USART_ClearITPendingBit(USART1,USART_IT_RXNE);
	}
}
